/* eslint-disable camelcase */
export const error = {
    label: 'បរាជ័យ',
    401: {
        title: '៤០១ - សូមអធ្យាស្រ័យ',
        des: 'អ្នកមិន​មានសិទ្ធិចូលប្រើប្រាស់ ទំព័រនេះទេ។'
    },
    403: {
        title: '៤០៣ - សូមអធ្យាស្រ័យ',
        des: 'អ្នក​មិន​មាន​សិទ្ធិ​ក្នុងការដំណើរការ នៅ​លើ​ម៉ាស៊ីន​នេះទេ​។'
    },
    404: {
        title: '៤០៤ - សូមអធ្យាស្រ័យ',
        des: 'យើងពុំអាចស្វែងរកទំព័រដែលអ្នកកំពុងស្វែងរកបានទេ។'
    },
    500: {
        title: '៥០០ - សូមអធ្យាស្រ័យ',
        des: 'ម៉ាស៊ីនរបស់យើងបានជួបនឹងប្រទះបញ្ហា ហើយមិនអាចបំពេញសំណើរបស់អ្នកបានទេ។'
    },
    unknown: {
        title: 'សូមអធ្យាស្រ័យ !',
        des: 'មាន​អ្វីមួយ​មិន​ប្រក្រតី។'
    }
}
