/* eslint-disable camelcase */
export const property_type = {
    label: 'ប្រភេទអចលនទ្រព្យ',
    id: 'អត្តលេខ',
    name: 'ឈ្មោះ',
    parent: 'ឪពុកម្តាយ',
    development_type: 'ប្រភេទការអភិវឌ្ឍន៍',
    form_group: 'ក្រុមទម្រង់',
    facilities: 'គ្រឿងបរិក្ខារ',
    created_by: 'បញ្ចូលដោយ',
    created_at: 'កាលបរិច្ឆេទដែលបានបញ្ចូល',
    last_update: 'ធ្វើបច្ចុប្បន្នភាពចុងក្រោយ',
    published: 'បោះផ្សាយ',
    properties_count: 'ចំនួនអចលនទ្រព្យ',
    title: {
        name: 'ប្រភេទអចលនទ្រព្យ',
        create: 'បង្កើតព័ត៌មានប្រភេទអចលនទ្រព្យថ្មី',
        edit: 'កែប្រែព័ត៌មានប្រភេទអចលនទ្រព្យ',
        search: 'ស្វែងរកគ្រឿងបរិក្ខារ',
        looking_for: 'ស្វែងរកប្រភេទអចលនទ្រព្យ'
    }
}

export const property_type_form = {
    new: 'បង្កើតព័ត៌មានប្រភេទអចលនទ្រព្យថ្មី',
    edit: 'កែប្រែព័ត៌មានប្រភេទអចលនទ្រព្យ',
    message: {
        success_create: 'ព័ត៌មានប្រភេទអចលនទ្រព្យថ្មីបានរក្សាទុកជោគជ័យ',
        success_update: 'ព័ត៌មានប្រភេទអចលនទ្រព្យបានរក្សាទុកជោគជ័យ',
        success_delete: 'ព័ត៌មានប្រភេទអចលនទ្រព្យបានរលុបចោលជោគជ័យ',
        error_create: 'ព័ត៌មានប្រភេទអចលនទ្រព្យថ្មីមិនបានរក្សាទុកជោគជ័យទេ',
        error_update: 'ព័ត៌មានប្រភេទអចលនទ្រព្យមិនបានរក្សាទុកជោគជ័យទេ',
        error_delete: 'ព័ត៌មានប្រភេទអចលនទ្រព្យមិនបានរក្សាទុកជោគជ័យទេ'
    }
}
